toasterllc/MDCCode/Code/MSP430/MSPApp/main.cpp
    // Task stack
    [[gnu::section(".stack._ImgTask")]]
    static inline uint8_t Stack[128];
};

// MARK: - Motion

static volatile bool _Motion = false;
static volatile bool _Busy = false;

template <typename T>
static void _ImgRingBufSet(volatile MSP::ImgRingBuf& dst, const T& src) {
    FRAMWriteEn writeEn; // Enable FRAM writing
    
    dst.magic = 0;
    atomic_thread_fence(std::memory_order_seq_cst);
    
    (const_cast<MSP::ImgRingBuf&>(dst)).buf = const_cast<MSP::ImgRingBuf&>(src).buf;
    atomic_thread_fence(std::memory_order_seq_cst);
    
    dst.magic = MSP::ImgRingBuf::MagicNumber;
}

// _ImgRingBufInit: find the correct ring buffer (the one with the greatest count and a valid magic number)
// and copy it into the other slot so that there are two copies. If neither slot contains a valid ring
// buffer, reset them both so that they're both empty (and valid).
static void _ImgRingBufInit() {
    using namespace MSP;
    
    auto& ringBuf = _State.img.ringBuf;
    auto& ringBuf2 = _State.img.ringBuf2;
    
    if (ringBuf.magic==ImgRingBuf::MagicNumber && ringBuf2.magic==ImgRingBuf::MagicNumber) {
        if (ringBuf.buf.count >= ringBuf2.buf.count) {
            // Copy ringBuf2 <- ringBuf
            _ImgRingBufSet(ringBuf2, ringBuf);
        } else {
            // Copy ringBuf <- ringBuf2
            _ImgRingBufSet(ringBuf, ringBuf2);
        }
    
    } else if (ringBuf.magic == ImgRingBuf::MagicNumber) {
        // Copy ringBuf2 <- ringBuf
        _ImgRingBufSet(ringBuf2, ringBuf);
    
    } else if (ringBuf2.magic == ImgRingBuf::MagicNumber) {
        // Copy ringBuf <- ringBuf2
        _ImgRingBufSet(ringBuf, ringBuf2);
    
    } else {
        // Both ringBuf and ringBuf2 are invalid
        // Reset them both
        _ImgRingBufSet(ringBuf, MSP::ImgRingBuf{});
        _ImgRingBufSet(ringBuf2, MSP::ImgRingBuf{});
    }
}

static void _ImgRingBufIncrement() {
    using namespace MSP;
    
    // Update _State.img.ringBuf
    {
        ImgRingBuf ringBuf = const_cast<ImgRingBuf&>(_State.img.ringBuf);
        
        // Update write index
        ringBuf.buf.widx++;
        // Wrap widx
        if (ringBuf.buf.widx >= _State.img.cap) ringBuf.buf.widx = 0;
        
        // Update read index (if we're currently full)
        if (ringBuf.buf.full) {
            ringBuf.buf.ridx++;
            // Wrap ridx
            if (ringBuf.buf.ridx >= _State.img.cap) ringBuf.buf.ridx = 0;
        }
        
        if (ringBuf.buf.widx == ringBuf.buf.ridx) ringBuf.buf.full = true;
        
        // Update the absolute image count
        ringBuf.buf.count++;
        
        _ImgRingBufSet(_State.img.ringBuf, ringBuf);
    }
    
    // Update _State.img.ringBuf2
    {
        // Copy ringBuf2 <- ringBuf
        _ImgRingBufSet(_State.img.ringBuf2, _State.img.ringBuf);
    }
}

static void _ImgCapture() {
    const auto& ringBuf = _State.img.ringBuf.buf;
    
    // Asynchronously turn on the image sensor / SD card
    _ImgTask::Enable();
    _SDTask::Enable();
    
    // Wait until the image sensor is ready
    _ImgTask::Wait();
    
    // Try up to `CaptureAttemptCount` times to capture a properly-exposed image
    constexpr uint8_t CaptureAttemptCount = 3;
    uint8_t bestExpBlock = 0;
    uint8_t bestExpScore = 0;
    for (uint8_t i=0; i<CaptureAttemptCount; i++) {
        // skipCount:
        // On the initial capture, we didn't set the exposure, so we don't need to skip any images.
        // On subsequent captures, we did set the exposure before the capture, so we need to skip a single
        // image since the first image after setting the exposure is invalid.
        const uint8_t skipCount = (!i ? 0 : 1);
        
        // expBlock: Store images in the block belonging to the worst-exposed image captured so far
        const uint8_t expBlock = !bestExpBlock;
        
        // Populate the header
        static Img::Header header = {
            .version        = Img::HeaderVersion,
            .imageWidth     = Img::PixelWidth,
            .imageHeight    = Img::PixelHeight,
            .coarseIntTime  = 0,
            .analogGain     = 0,
            .count          = 0,
            .timeStart      = 0,
            .timeDelta      = 0,
        };
        
        header.coarseIntTime = _ImgAutoExp.integrationTime();
        header.count = ringBuf.count;
        
        const MSP::Time t = _RTC.time();
        header.timeStart = t.start;
        header.timeDelta = t.delta;
        
        // Capture an image to RAM
        const _ICE::ImgCaptureStatusResp resp = _ICE::ImgCapture(header, expBlock, skipCount);
        const uint8_t expScore = _ImgAutoExp.update(resp.highlightCount(), resp.shadowCount());
        if (!bestExpScore || (expScore > bestExpScore)) {
            bestExpBlock = expBlock;
            bestExpScore = expScore;
        }
        
        // We're done if we don't have any exposure changes
        if (!_ImgAutoExp.changed()) break;
        
        // Update the exposure
        _ImgSensor::SetCoarseIntTime(_ImgAutoExp.integrationTime());
    }
    
    // Wait until the SD card is ready
    _SDTask::Wait();
    
    // Write the best-exposed image to the SD card
    _SDCard.writeImage(bestExpBlock, ringBuf.widx);
    
    // Update _State.img
    _ImgRingBufIncrement();
}

// MARK: - Interrupts

[[gnu::interrupt(RTC_VECTOR)]]
static void _ISR_RTC() {
    _RTC.isr();
}

[[gnu::interrupt(PORT2_VECTOR)]]
static void _ISR_Port2() {
    // Accessing `P2IV` automatically clears the highest-priority interrupt
    switch (__even_in_range(P2IV, P2IV__P2IFG5)) {
    case P2IV__P2IFG5:
        _Motion = true;
        // Wake ourself
        #warning figure out if we want to clear GIE here, especially wrt _Scheduler. don't think we do because we may just be running a task, and we don't want to change the interrupt state out from under it
        __bic_SR_register_on_exit(LPM3_bits);
        break;
    
    default:
        break;
    }
}

[[gnu::interrupt(WDT_VECTOR)]]
static void _ISR_SysTick() {
    const bool wake = _Scheduler::Tick();
    if (wake) {
        // Wake ourself
        #warning figure out if we want to clear GIE here, especially wrt _Scheduler. don't think we do because we may just be running a task, and we don't want to change the interrupt state out from under it
        __bic_SR_register_on_exit(LPM3_bits);
    }
}

// MARK: - ICE40

template<>
void _ICE::Transfer(const Msg& msg, Resp* resp) {
    AssertArg((bool)resp == (bool)(msg.type & _ICE::MsgType::Resp));
    
    // Init SPI peripheral
    static bool spiInit = false;
    if (!spiInit) {
        spiInit = true;
        _SPI::Init();
    }
    
    // iceInit: Stored in BAKMEM (RAM that's retained in LPM3.5) so that
    // it's maintained during sleep, but reset upon a cold start.
    [[gnu::section(".ram_backup.main")]]
    static bool iceInit = false;
    
    // Init ICE comms
    if (!iceInit) {
        iceInit = true;
        // Reset ICE comms (by asserting SPI CLK for some length of time)
        _SPI::ICEReset();
        // Init ICE comms
        _ICE::Init();
    }
    
//    // Init ICE40 if we haven't done so yet
//    static bool iceInit = false;
//    if (!iceInit) {
//        // Init SPI/ICE40
//        if (Startup::ColdStart()) {
//            constexpr bool iceReset = true; // Cold start -> reset ICE40 SPI state machine
//            _SPI::Init(iceReset);
//            _ICE::Init(); // Cold start -> init ICE40 to verify that comms are working
//        
//        } else {
//            constexpr bool iceReset = false; // Warm start -> no need to reset ICE40 SPI state machine
//            _SPI::Init(iceReset);
//        }
//    }
    
    _SPI::WriteRead(msg, resp);
}

